Res-firecracker-setEven-randomFront-v66/firecracker_t_10_c_30_frontVcpu_8_wrkVcpu_2/wrk.txt
Running 1m test @ http://frontend:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4455.264ms, rate sampling interval: 16908ms
  Thread calibration: mean lat.: 4320.004ms, rate sampling interval: 17055ms
  Thread calibration: mean lat.: 5085.426ms, rate sampling interval: 17743ms
  Thread calibration: mean lat.: 5094.870ms, rate sampling interval: 18006ms
  Thread calibration: mean lat.: 5189.327ms, rate sampling interval: 18186ms
  Thread calibration: mean lat.: 5081.718ms, rate sampling interval: 17891ms
  Thread calibration: mean lat.: 4476.831ms, rate sampling interval: 16826ms
  Thread calibration: mean lat.: 4205.321ms, rate sampling interval: 16580ms
  Thread calibration: mean lat.: 5096.894ms, rate sampling interval: 17809ms
  Thread calibration: mean lat.: 5126.465ms, rate sampling interval: 18153ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    31.02s    13.07s    0.97m    62.17%
    Req/Sec   234.67      4.41   243.00     71.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   29.74s 
 75.000%   40.96s 
 90.000%   50.33s 
 99.000%    0.97m 
 99.900%    0.99m 
 99.990%    0.99m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2625.535     0.000000            1         1.00
   13967.359     0.100000        11742         1.11
   18743.295     0.200000        23490         1.25
   22904.831     0.300000        35218         1.43
   26312.703     0.400000        46933         1.67
   29736.959     0.500000        58685         2.00
   31457.279     0.550000        64591         2.22
   33325.055     0.600000        70445         2.50
   35553.279     0.650000        76335         2.86
   38109.183     0.700000        82156         3.33
   40959.999     0.750000        88071         4.00
   42336.255     0.775000        91007         4.44
   43745.279     0.800000        93911         5.00
   45252.607     0.825000        96827         5.71
   46825.471     0.850000        99780         6.67
   48660.479     0.875000       102673         8.00
   49512.447     0.887500       104170         8.89
   50331.647     0.900000       105612        10.00
   51216.383     0.912500       107091        11.43
   52133.887     0.925000       108532        13.33
   53149.695     0.937500       110020        16.00
   53673.983     0.943750       110773        17.78
   54165.503     0.950000       111471        20.00
   54755.327     0.956250       112223        22.86
   55312.383     0.962500       112940        26.67
   55803.903     0.968750       113661        32.00
   56098.815     0.971875       114051        35.56
   56426.495     0.975000       114423        40.00
   56754.175     0.978125       114793        45.71
   56983.551     0.981250       115142        53.33
   57311.231     0.984375       115528        64.00
   57475.071     0.985938       115702        71.11
   57638.911     0.987500       115873        80.00
   57835.519     0.989062       116073        91.43
   58032.127     0.990625       116246       106.67
   58228.735     0.992188       116420       128.00
   58359.807     0.992969       116508       142.22
   58490.879     0.993750       116620       160.00
   58621.951     0.994531       116705       182.86
   58753.023     0.995313       116785       213.33
   58884.095     0.996094       116880       256.00
   58949.631     0.996484       116932       284.44
   59015.167     0.996875       116981       320.00
   59047.935     0.997266       117011       365.71
   59179.007     0.997656       117075       426.67
   59244.543     0.998047       117100       512.00
   59277.311     0.998242       117125       568.89
   59342.847     0.998437       117152       640.00
   59375.615     0.998633       117181       731.43
   59408.383     0.998828       117199       853.33
   59441.151     0.999023       117215      1024.00
   59473.919     0.999121       117226      1137.78
   59506.687     0.999219       117241      1280.00
   59539.455     0.999316       117250      1462.86
   59572.223     0.999414       117271      1706.67
   59572.223     0.999512       117271      2048.00
   59604.991     0.999561       117286      2275.56
   59604.991     0.999609       117286      2560.00
   59637.759     0.999658       117300      2925.71
   59637.759     0.999707       117300      3413.33
   59637.759     0.999756       117300      4096.00
   59670.527     0.999780       117315      4551.11
   59670.527     0.999805       117315      5120.00
   59670.527     0.999829       117315      5851.43
   59670.527     0.999854       117315      6826.67
   59670.527     0.999878       117315      8192.00
   59670.527     0.999890       117315      9102.22
   59703.295     0.999902       117322     10240.00
   59703.295     0.999915       117322     11702.86
   59703.295     0.999927       117322     13653.33
   59703.295     0.999939       117322     16384.00
   59703.295     0.999945       117322     18204.44
   59703.295     0.999951       117322     20480.00
   59703.295     0.999957       117322     23405.71
   59736.063     0.999963       117325     27306.67
   59736.063     0.999969       117325     32768.00
   59736.063     0.999973       117325     36408.89
   59736.063     0.999976       117325     40960.00
   59736.063     0.999979       117325     46811.43
   59736.063     0.999982       117325     54613.33
   59768.831     0.999985       117327     65536.00
   59768.831     1.000000       117327          inf
#[Mean    =    31017.947, StdDeviation   =    13069.525]
#[Max     =    59736.064, Total count    =       117327]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  139852 requests in 1.00m, 57.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 28
Requests/sec:   2330.99
Transfer/sec:      0.97MB